؁
،
،،
،آپ
،اب
،اس
،ان
،اور
،ایک
،بلکہ
،تاکہ
،تم
،تو
،جب
،جس
،جو
،جہاں
،لیکن
،مجھے
،مگر
،میں
،وہ
،پھر
،کراچی
،کیونکہ
،کیوں
،یہ
؎
ؐ
ؑ
ؓ
؛
ء
آ
آؤ
آؤں
آئ
آئس
آئندہ
آئی
آئیں
آئیے
آئے
آبا
آباد
آبادی
آتا
آتی
آتے
آثار
آج
آجائیں
آجائے
آجاتا
آخر
آخری
آد
آدم
آدمی
آدھا
آدھی
آر
آرا
آرام
آرہا
آرہی
آرہے
آز
آزا
آزاد
آزادی
آزما
آس
آسان
آسانی
آسمان
آصف
آغ
آغاز
آف
آفتاب
آفس
آلو
آلہ
آم
آمد
آمدنی
آمنہ
آن
آنا
آنسو
آنٹی
آنکھ
آنکھوں
آنکھیں
آنے
آواز
آوازیں
آور
آٹھ
آپ
آپا
آپس
آپی
آکر
آگ
آگئی
آگئیں
آگئے
آگاہ
آگیا
آگے
آہ
آہستہ
آیا
آیا،
أ
ؤ
ؤن
ؤں
ئ
ئر
ئش
ئل
ئلہ
ئم
ئن
ئی
ئیاں
ئین
ئیں
ئیے
ئے
ا
ائ
ائب
ائی
اب
ابا
ابت
ابر
ابراہیم
ابق
ابن
ابو
ابّا
ابّو
ابھی
ات
اتار
اتر
اتفاق
اتنا
اتنی
اتنے
اتو
اتوار
اث
اثر
اج
اجا
اجازت
اجن
اجنبی
اح
احت
احترام
احتشام
احتیاط
احد
احساس
احسان
احسن
احمد
اخ
اخبار
اخت
اختیار
اخراجات
اخلا
اخلاق
اد
ادا
ادارے
اداس
ادب
ادھر
ادی
ادیب
اذ
ار
ارا
ارادہ
ارت
ارد
اردو
اردگرد
ارسلان
ارشد
ارف
ارم
اروں
ارہ
ارہے
اری
ارے
از
ازی
اس
اسات
اساتذہ
اسب
است
استاد
استع
استعمال
استق
استقبال
اسد
اسر
اسلام
اسلامی
اسلم
اسم
اسٹ
اسٹی
اسٹیشن
اسپتال
اسکول
اسکی
اسکے
اسی
اسے
اش
اشارہ
اشر
اشرف
اشرفی
اشرفیاں
اشرفیوں
اشیا
اص
اصرار
اصغر
اصل
اصلی
اصول
اض
اضافہ
اط
اطلاع
اطمینان
اطہر
اظ
اظہار
اع
اعت
اعتبار
اعتم
اعتماد
اعظم
اعلان
اعلی
اعلیٰ
اغ
اغوا
اف
افراد
افری
افزا
افسر
افسردہ
افسوس
افشاں
افظ
افہ
اق
اقب
اقبال
اقرا
اقسام
ال
الا
الب
البتہ
الت
الدین
الز
الزام
السلام
الفاظ
اللہ
الم
الماری
الو
الگ
الہ
الی
الیا
الیس
ام
امام
امان
امانت
اماں
امت
امتح
امتحان
امتحانات
امجد
امد
امرو
امرود
امری
امن
امو
امہ
امی
امید
امیر
امین
ان
انا
اناج
انت
انتظ
انتظار
انتظام
انتق
انتقال
انتہا
انتہائی
انجام
اندا
انداز
اندازہ
اندر
اندوز
اندھ
اندھیرا
اندھیرے
انس
انسان
انسانوں
انسانی
انسپکٹر
انسی
انشاء
انصاف
انعام
انو
انور
انوں
انٹ
انٹر
انپ
انچ
انچہ
انڈ
انڈا
انڈوں
انڈے
انکار
انکل
انگ
انگری
انگریزی
انگلی
انگو
انگوٹھی
انگی
انگیز
انھ
انھوں
انھیں
انہ
انہوں
انہی
انہیں
انی
انیاں
انیہ
انے
او
اور
اوق
اوقات
اول
اولاد
اون
اونٹ
اونچی
اونچے
اوپر
اوہ
اَ
اُ
اُت
اُتار
اُتر
اُد
اُداس
اُدھر
اُس
اُسکی
اُسکے
اُسی
اُسے
اُل
اُلو
اُمید
اُن
اُنہوں
اُنہیں
اُٹھ
اُٹھا
اُٹھائے
اُٹھایا
اُٹھی
اُٹھے
اُچھل
اُڑ
اُڑا
اُڑنے
اِ
اِدھر
اِس
آ
آپ
اٹ
اٹھ
اٹھا
اٹھائے
اٹھایا
اپ
اپنا
اپنی
اپنے
اچانک
اچھ
اچھا
اچھل
اچھی
اچھے
اڑ
اڑا
اک
اکبر
اکثر
اکرم
اکلو
اکٹھے
اکی
اکیلا
اکیلے
اگ
اگر
اگرچہ
اگست
اگلی
اگلے
اں
اہ
اہتمام
اہر
اہرہ
اہل
اہلیہ
اہم
اہمیت
ای
ایا
ایت
ایجاد
ایسا
ایسی
ایسے
ایم
ایمان
ایمن
ایک
اے
ب
با
بائی
بائیں
باب
بابا
بابر
بابو
بات
باتوں
باتیں
باجی
باد
بادشاہ
بادل
بار
بارش
بارک
بارہ
باری
بارے
باز
بازار
بازو
بازی
باس
باش
باعث
باغ
باغی
باق
باقی
بال
بالآخر
بالا
بالوں
بالکل
بالے
بان
باندھ
بانو
بانٹ
بانی
باوجود
باور
باورچی
باپ
باہر
ببلو
بت
بتا
بتاؤ
بتاؤں
بتائی
بتائیں
بتائے
بتاتا
بتاتے
بتانا
بتانے
بتایا
بتلا
بج
بجا
بجائے
بجلی
بجے
بح
بحث
بخ
بخار
بخت
بخش
بد
بدل
بدلہ
بدلے
بدن
بر
برا
برابر
برباد
برت
برتن
برداشت
برس
برسوں
برف
برو
برکت
برگد
بری
بریانی
برے
بز
بزر
بزرگ
بس
بست
بستر
بستہ
بستی
بسر
بش
بشیر
بط
بطخ
بع
بعد
بعض
بغ
بغیر
بل
بلا
بلاقی
بلال
بلایا
بلبل
بلند
بلو
بلکہ
بلی
بلیوں
بن
بنا
بنائی
بنائیں
بنائے
بناتے
بنانا
بنانے
بنایا
بنتا
بند
بندر
بندروں
بندو
بندوبست
بندوق
بندھ
بننا
بننے
بنوا
بنٹی
بنگ
بنی
بنیاد
بنے
بو
بوت
بوتل
بوجھ
بور
بورڈ
بوری
بوط
بول
بولا
بولا،
بولتا
بولتے
بولنا
بولنے
بولو
بولی
بولیں
بولے
بونا
بونے
بوڑھ
بوڑھا
بوڑھی
بوڑھے
بُ
بُرا
بُری
بُرے
بٹ
بٹا
بٹن
بٹھا
بچ
بچا
بچانے
بچنے
بچو
بچوں
بچپن
بچھا
بچہ
بچی
بچے
بڑ
بڑا
بڑبڑا
بڑوں
بڑھ
بڑھا
بڑھتا
بڑھتی
بڑھنے
بڑھی
بڑھیا
بڑھے
بڑی
بڑے
بک
بکر
بکرا
بکری
بکرے
بکھ
بگڑ
بگھی
بھ
بھئی
بھا
بھائی
بھائیوں
بھار
بھارت
بھاری
بھال
بھالو
بھاگ
بھاگا
بھاگتا
بھاگتے
بھاگنے
بھاگے
بھر
بھرا
بھرو
بھرپور
بھری
بھرے
بھلا
بھلائی
بھو
بھوت
بھوری
بھول
بھون
بھوک
بھوکا
بھوکے
بھگ
بھگا
بھی
بھیا
بھیج
بھیجا
بھینس
بھیڑ
بھیڑیا
بھیڑیے
بہ
بہا
بہادر
بہادری
بہار
بہانہ
بہانے
بہت
بہتر
بہترین
بہر
بہن
بہنوں
بہو
بہہ
بی
بیان
بیت
بیج
بیدار
بیدہ
بیر
بیس
بیل
بیمار
بیماری
بین
بینک
بیوی
بیٹا
بیٹوں
بیٹھ
بیٹھا
بیٹھتے
بیٹھنے
بیٹھی
بیٹھے
بیٹی
بیٹیوں
بیٹے
بیچ
بیچنے
بیگ
بیگم
بیہ
بے
ة
ت
تا
تا،
تاب
تاج
تاجر
تاد
تار
تاری
تاریخ
تازہ
تال
تالاب
تان
تاً
تاکہ
تاہم
تب
تبا
تباہ
تبدی
تبدیل
تبدیلی
تبھی
تجار
تجر
تجربہ
تجس
تجسس
تجو
تجویز
تجھ
تجھے
تح
تحت
تحریر
تحفہ
تحفے
تحقی
تحقیق
تخت
تر
تربیت
ترتی
ترتیب
ترس
ترقی
ترکی
ترکیب
تری
ترین
تز
تزئین
تسلی
تش
تشریف
تصور
تصویر
تصویریں
تع
تعارف
تعالی
تعالیٰ
تعداد
تعریف
تعلق
تعلی
تعلیم
تعلیمی
تعمیر
تف
تفری
تفریح
تفصی
تفصیل
تق
تقری
تقریب
تقریبا
تقریباً
تقریر
تقسیم
تل
تلا
تلاش
تلاشی
تلو
تلوار
تلی
تلے
تم
تما
تمام
تمھ
تمھارا
تمھاری
تمھارے
تمھیں
تمہ
تمہارا
تمہاری
تمہارے
تمہیں
تمی
تمیز
تن
تنخواہ
تنگ
تنہا
تنے
تو
توبہ
توجہ
توقع
تول
تون
توڑ
توں
تُو
تڑپ
تک
تکلیف
تھ
تھا
تھا،
تھا،اس
تھا،لیکن
تھا،مگر
تھام
تھانے
تھاکہ
تھر
تھما
تھو
تھوڑا
تھوڑی
تھوڑے
تھک
تھکا
تھکے
تھی
تھی،
تھیلا
تھیلی
تھیلے
تھیں
تھیں،
تھے
تھے،
تہ
تی
تیار
تیاری
تیر
تیرا
تیری
تیرے
تیز
تیزی
تیس
تیسرا
تیسری
تیسرے
تیل
تیلی
تین
تینوں
تیں
تے
ث
ثابت
ثار
ثاقب
ثبوت
ثر
ثریا
ثنا
ثواب
ثیت
ج
جئے
جا
جاؤ
جاؤ،
جاؤں
جائ
جائزہ
جائی
جائیں
جائے
جائے،
جاب
جات
جاتا
جاتاہے
جاتی
جاتیں
جاتے
جاد
جادو
جادوئی
جادوگر
جادوگرنی
جار
جارہا
جارہی
جارہے
جاری
جاز
جاس
جال
جام
جان
جانا
جانب
جانتا
جانتی
جانتے
جانور
جانوروں
جانی
جانے
جاوٴ
جاوی
جاوید
جاپ
جاکر
جاگ
جاہ
جایا
جب
جبکہ
جت
جتنا
جتنی
جتنے
جد
جدو
جذ
جذبات
جذبہ
جر
جرا
جرم
جرہ
جرے
جز
جزیرے
جس
جسم
جسے
جشن
جل
جلا
جلد
جلدی
جم
جما
جماعت
جمال
جمع
جملہ
جمیل
جمیلہ
جن
جنا
جناب
جناح
جنت
جنگ
جنگل
جنگلی
جنھ
جنہیں
جو
جوا
جواب
جواد
جوان
جوتوں
جوتے
جود
جور
جوس
جوش
جون
جونہی
جوڑ
جوں
جڑ
جک
جگ
جگنو
جگہ
جھ
جھا
جھان
جھانکا
جھاڑ
جھاڑیوں
جھل
جھن
جھنڈ
جھو
جھول
جھولا
جھولے
جھون
جھونپڑی
جھوٹ
جھٹ
جھک
جھکا
جھکائے
جھگڑا
جھی
جھیل
جہ
جہا
جہاز
جہاں
جی
جیب
جیت
جیسا
جیسی
جیسے
جیل
جیے
جے
ح
حا
حاتم
حاد
حادث
حادثے
حار
حارث
حاصل
حاضر
حاظ
حافظ
حال
حالات
حالان
حالانکہ
حالت
حامد
حان
حانہ
حت
حج
حد
حدہ
حر
حرام
حرکت
حری
حس
حساب
حسب
حسد
حسن
حسین
حص
حصہ
حصے
حض
حضر
حضرت
حضور
حفاظ
حفاظت
حق
حقی
حقیقت
حل
حلق
حم
حما
حماد
حمزہ
حملہ
حمید
حو
حواس
حوالے
حوص
حوصلہ
حول
حویلی
حکم
حکمر
حکو
حکومت
حکیم
حہ
حی
حیثیت
حید
حیدر
حیر
حیران
حیرانی
حیرت
خ
خا
خاتون
خاد
خادم
خار
خاص
خاصا
خاصی
خاطب
خاطر
خال
خالد
خالہ
خالی
خاموش
خاموشی
خان
خاندان
خانہ
خانے
خاں
خبر
خت
ختم
ختہ
ختی
خد
خدا
خدمت
خر
خرا
خراب
خرم
خرچ
خرگوش
خری
خرید
خریدا
خریداری
خریدنے
خز
خزانہ
خزانے
خشک
خص
خصو
خصوص
خصوصی
خط
خطر
خطرناک
خطرہ
خطرے
خل
خلا
خلاف
خلو
خلی
خلیفہ
خن
خو
خوا
خواب
خواتین
خوار
خواست
خواہ
خواہش
خوب
خوبصورت
خوبصورتی
خوبی
خود
خور
خوراک
خوش
خوشبو
خوشگوار
خوشی
خوشیاں
خوشیوں
خوف
خوفزدہ
خوفناک
خون
خی
خیا
خیال
خیالات
خیر
خیریت
د
دئیے
دا
دائی
دائیں
دات
داخ
داخل
داخلہ
داد
دادا
دادی
دار
داروں
داری
داست
داستان
داشت
دال
دام
دان
دانت
دانتوں
دانش
دانوں
دانہ
دانی
دانے
دب
دبا
دبو
در
درا
دراز
دراصل
دربار
درباری
درخت
درختوں
درخواست
درد
دردی
درست
درمیان
درو
دروا
دروازہ
دروازے
درویش
دری
دریا
دریافت
دس
دست
دستک
دستی
دش
دشمن
دعا
دعائیں
دعو
دعوت
دف
دفتر
دفعہ
دل
دلا
دلاور
دلچسپ
دلچسپی
دلی
دم
دما
دماغ
دمے
دن
دنوں
دنیا
دو
دو،
دوا
دوبارہ
دودھ
دور
دوران
دوز
دوس
دوست
دوستو
دوستوں
دوستی
دوسر
دوسرا
دوسروں
دوسری
دوسرے
دوق
دولت
دونوں
دوپہر
دوڑ
دوڑا
دوڑتا
دوں
دُ
دُم
دڑ
دکان
دکھ
دکھا
دکھائی
دکھایا
دگی
دھ
دھا
دھار
دھر
دھری
دھم
دھو
دھوبی
دھوپ
دھڑ
دھکا
دھی
دھیان
دھیرے
دھے
دہ
دہشت
دہی
دی
دی،
دیئے
دیا
دیا،
دیاں
دیتا
دیتی
دیتے
دیجیے
دید
دیدہ
دیر
دین
دینا
دینو
دینی
دینے
دیو
دیوار
دیکھ
دیکھا
دیکھا،
دیکھتا
دیکھتی
دیکھتے
دیکھنا
دیکھنے
دیکھو
دیکھی
دیکھیں
دیکھے
دیگ
دیگر
دیں
دیہ
دیے
دے
ذ
ذا
ذات
ذر
ذرا
ذری
ذریعے
ذمہ
ذمے
ذکر
ذہ
ذہانت
ذہن
ذہنی
ذہین
ذی
ذیر
ر
را
رائی
رائے
راب
رابطہ
رات
راج
راجا
راجو
راجہ
راحی
راحیل
راد
رار
راز
راس
راستہ
راستے
راشد
راض
راضی
راف
رام
رانی
راہ
راہیم
رب
رح
رحم
رحمان
رحمت
رحی
رحیم
رخ
رخص
رخصت
رز
رزق
رس
رسول
رسی
رشتہ
رشتے
رشی
رشید
رض
رضا
رضوان
رضی
رعا
رعایا
رف
رفتار
رفتہ
رفیق
رق
رقم
رمض
رمضان
رمضو
رنگ
رو
روا
روانہ
روبی
روتا
روتے
روح
روز
روزانہ
روزہ
روزے
روش
روشن
روشنی
روف
رول
روم
رومال
رونا
رونق
رونے
روٹی
روپ
روپے
روک
رویہ
رویے
رُ
رُخ
رپورٹ
رک
رکا
رکھ
رکھا
رکھتا
رکھتی
رکھتے
رکھنا
رکھنے
رکھو
رکھی
رکھیں
رکھے
رہ
رہا
رہاتھا
رہتا
رہتی
رہتے
رہنا
رہنے
رہو
رہوں
رہی
رہیں
رہے
ری
ریا
ریاست
ریاض
ریب
ریت
ریحان
ریش
ریشماں
ریف
ریل
رین
ریچھ
ریک
رے
ز
زا
زار
زاق
زانے
زبان
زبر
زبردست
زبردستی
زبیدہ
زت
زخ
زخم
زخمی
زدہ
زر
زرا
زریں
زل
زمان
زمانہ
زمانے
زمی
زمین
زمیند
زمیندار
زنج
زند
زندگی
زندہ
زو
زور
زوں
زہ
زہر
زی
زیا
زیادہ
زیب
زیر
زیشن
زین
زینب
زیور
زیورات
زے
س
سا
سائ
سائل
سائنس
سائی
سائیکل
سائے
سات
ساتو
ساتھ
ساتھی
ساتھیوں
ساجد
سادہ
سار
سارا
سارہ
ساری
سارے
ساز
ساس
سال
سالار
سالانہ
سالوں
سالگرہ
سالہ
سام
سامان
سامنا
سامنے
سان
سانس
سانپ
سایہ
سب
سبب
سبز
سبزی
سبزیاں
سبق
سبھی
ست
ستا
ستارہ
ستارے
ستان
ستانی
ستم
ستھ
ستہ
سخت
سختی
سر
سرا
سرائے
سرت
سرخ
سرد
سردار
سردی
سردیوں
سرما
سروش
سرکاری
سری
سرے
سزا
سس
سست
سط
سطح
سعد
سعید
سفر
سفید
سل
سلا
سلام
سلامت
سلان
سلسلہ
سلسلے
سلط
سلطان
سلمان
سلمیٰ
سلوک
سلہ
سلی
سلیم
سلیمان
سلے
سم
سما
سمت
سمجھ
سمجھا
سمجھاتے
سمجھانے
سمجھایا
سمجھتا
سمجھتے
سمجھنے
سمجھے
سمندر
سمو
سمی
سمیت
سن
سنا
سنائی
سنار
سنایا
سنبھ
سنبھال
سنتا
سنتے
سنجی
سننے
سنو
سنہ
سنہری
سنی
سنے
سو
سوا
سوار
سواری
سوال
سوالات
سوتے
سودا
سوداگر
سور
سورا
سوراخ
سورج
سوس
سول
سونا
سونگھ
سونے
سوچ
سوچا
سوچتا
سوچتی
سوچتے
سوچنے
سوں
سویرے
سُ
سُن
سٹ
سپا
سپاہی
سپاہیوں
سپر
سپہ
سچ
سچی
سڑک
سک
سکا
سکتا
سکتی
سکتے
سکندر
سکو
سکول
سکون
سکوں
سکہ
سکی
سکیں
سکے
سہ
سہارا
سہم
سہو
سہی
سہیل
سہیلی
سہیلیوں
سی
سیا
سیاہ
سیب
سیدھا
سیدھی
سیدھے
سیر
سیف
سیم
سین
سینہ
سینے
سیٹ
سیٹھ
سیڑھ
سیکھ
سے
ش
شا
شاء
شائ
شائع
شاباش
شاخ
شاخوں
شاد
شادی
شاز
شازیہ
شام
شامل
شامی
شان
شاندار
شانی
شاگرد
شاں
شاہ
شاہد
شاہی
شای
شاید
شت
شتہ
شتے
شخص
شخصیت
شد
شدت
شدہ
شدید
شر
شرار
شرارت
شرارتوں
شرارتی
شربت
شرط
شرفو
شرم
شرمند
شرمندگی
شرمندہ
شرو
شروع
شرکت
شریف
شریک
شش
شع
شف
شفقت
شم
شما
شمار
شمع
شن
شنا
شو
شور
شوق
شوکت
شوہر
شک
شکا
شکار
شکاری
شکایت
شکر
شکریہ
شکست
شکل
شکیل
شہ
شہا
شہد
شہر
شہرت
شہری
شہزا
شہزاد
شہزادوں
شہزادہ
شہزادی
شہزادے
شہلا
شہید
شی
شیخ
شیر
شیراز
شیرو
شیشے
شیط
شین
شے
ص
صائ
صائمہ
صاح
صاحب
صاحبہ
صاف
صبح
صبر
صح
صحت
صحرا
صحن
صحی
صحیح
صد
صدر
صدی
صر
صرف
صف
صفائی
صل
صلاح
صلاحیت
صلی
صن
صندوق
صو
صور
صورت
صورتحال
صورتی
صہ
صی
صے
ض
ضائع
ضح
ضد
ضر
ضرور
ضرورت
ضروری
ضل
ضوع
ضہ
ضی
ضیا
ط
طار
طارق
طاری
طاق
طاقت
طاقتور
طالب
طاہر
طب
طبی
طبیعت
طر
طرح
طرف
طری
طریقہ
طریقے
طل
طلب
طور
طوط
طوطا
طوطے
طوف
طوفان
طویل
طہ
طی
طے
ظ
ظالم
ظاہر
ظر
ظفر
ظلم
ظم
ع
عا
عائ
عائشہ
عاب
عابد
عاد
عادت
عادل
عادی
عار
عارف
عاص
عاصم
عال
عالم
عالی
عالیہ
عام
عامر
عب
عباد
عبادت
عبد
عبدال
عبداللہ
عت
عث
عثمان
عجیب
عد
عدالت
عدن
عدنان
عدی
عر
عرب
عرصہ
عرصے
عرض
عرف
عرفان
عز
عزت
عزتی
عزم
عزی
عزیز
عط
عطا
عظ
عظم
عظیم
عق
عقاب
عقل
عل
علا
علاج
علاقوں
علاقہ
علاقے
علامہ
علاوہ
علم
علی
علیہ
عم
عمار
عمارت
عمدہ
عمر
عمران
عمل
عملی
عنا
عنہ
عنی
عو
عوام
عورت
عہ
عہد
عی
عیب
عید
عین
عے
غ
غائب
غار
غام
غذ
غذا
غر
غربت
غرض
غرور
غریب
غریبوں
غصہ
غصے
غل
غلام
غلط
غلطی
غم
غور
غیر
ف
فا
فائ
فائدہ
فاختہ
فار
فارغ
فارم
فاروق
فاص
فاصلے
فاط
فاطمہ
فاظ
فاق
فال
فان
فت
فتح
فتہ
فخر
فر
فرا
فراز
فراہم
فرت
فرحان
فرد
فرش
فرض
فرق
فرقان
فرما
فرمائش
فرمان
فرمایا
فرو
فروخت
فری
فرید
فصل
فض
فضا
فضل
فضول
فطر
فطرت
فق
فقیر
فل
فلا
فن
فو
فوا
فواد
فوج
فوجی
فورا
فوراً
فوراََ
فوری
فون
فٹ
فکر
فہ
فہد
فہمی
فہیم
فی
فیت
فید
فیس
فیسر
فیص
فیصد
فیصل
فیصلہ
فیصلے
فیض
فیق
فیل
فیک
فیکٹری
فے
ق
قا
قائ
قائد
قائدا
قائداعظم
قائم
قاب
قابل
قابو
قات
قاسم
قاضی
قاف
قالی
قالین
قان
قانون
قب
قبر
قبضہ
قبل
قبول
قت
قتل
قد
قدر
قدرت
قدم
قدموں
قدی
قدیم
قر
قرآن
قرار
قربان
قربانی
قرض
قری
قریب
قریبی
قسم
قسمت
قسمتی
قص
قصبے
قصور
قصہ
قطار
قطر
قع
قل
قلم
قو
قوت
قول
قوم
قومی
قوں
قہ
قہقہ
قہقہہ
قی
قیا
قیام
قید
قیمت
قیمتی
قین
قے
ل
لئے
لا
لاؤ
لائ
لائبر
لائبریری
لائن
لائٹ
لائی
لائیں
لائے
لات
لاتا
لاتی
لاتے
لاح
لاد
لاش
لاع
لال
لالچ
لالچی
لام
لامی
لان
لانے
لاڈ
لاکھ
لاکھوں
لاہور
لایا
لب
لباس
لت
لط
لطف
لف
لفظ
لق
لم
لمبا
لمبی
لمبے
لمح
لمحوں
لمحہ
لمحے
لنچ
لنگ
لو
لو،
لوا
لوم
لومڑی
لوٹ
لوٹا
لوک
لوگ
لوگوں
لوں
لوہے
لوی
لٹ
لٹکا
لپٹ
لپیٹ
لڑ
لڑائی
لڑکا
لڑکوں
لڑکی
لڑکیاں
لڑکیوں
لڑکے
لک
لکڑ
لکڑہارا
لکڑہارے
لکڑی
لکڑیاں
لکھ
لکھا
لکھنے
لکھی
لکھے
لگ
لگا
لگا،
لگائی
لگائے
لگاتا
لگاتے
لگانا
لگانے
لگایا
لگتا
لگتی
لگتے
لگنے
لگی
لگی،
لگیں
لگے
لہ
لہجے
لہر
لہرا
لہٰ
لہٰذا
لی
لیا
لیاں
لیتا
لیتی
لیتے
لیز
لیس
لیف
لیم
لینا
لینے
لیوں
لیٹ
لیٹا
لیک
لیکم
لیکن
لیں
لیہ
لیے
لے
م
ما
مات
ماجرا
ماحول
مادہ
مار
مارا
مارنے
مارکی
ماری
ماریہ
مارے
ماس
ماسٹر
ماضی
مال
مالک
مالی
مام
ماما
ماموں
مان
مانا
مانس
مانو
مانگ
مانگنے
مانگی
مانی
مانے
ماں
ماہ
ماہر
مایو
مایوس
مایوسی
مبارک
مبتلا
مت
متا
متاثر
متع
متعلق
متوجہ
متی
مث
مثال
مثلا
مجب
مجبور
مجبورا
مجبوراً
مجرم
مجھ
مجھے
مح
محب
محبت
محبّت
محتر
محترم
محروم
محسوس
محض
محفوظ
محل
محلے
محمد
محمود
محنت
محکم
مخاطب
مخت
مختصر
مختلف
مخصوص
مخلو
مخلوق
مد
مدد
مدر
مذ
مذاق
مذہ
مر
مرا
مران
مرت
مرتبہ
مرد
مرزا
مرضی
مرغ
مرغا
مرغی
مرغیاں
مرغے
مرمت
مرنے
مرو
مرہ
مری
مریض
مریم
مرے
مز
مزا
مزاج
مزدور
مزدوری
مزہ
مزی
مزید
مزے
مس
مسئ
مسئلہ
مسئلے
مسا
مسائل
مسافر
مسافروں
مست
مستقبل
مسجد
مسرت
مسز
مسل
مسلسل
مسلمان
مسلمانوں
مسٹر
مسکرا
مسکراتے
مسکرانے
مسکراہ
مسکراہٹ
مسکرایا
مش
مشر
مشغ
مشور
مشورہ
مشک
مشکل
مشکلات
مشہ
مشہور
مشین
مص
مصروف
مصیبت
مض
مضبوط
مضبوطی
مضمون
مط
مطابق
مطال
مطلب
مطم
مطمئن
مظ
مظاہرہ
مع
معا
معاذ
معاشر
معاشرے
معاف
معافی
معام
معاملہ
معاملے
معصو
معصوم
معلو
معلوم
معلومات
معمو
معمول
معمولی
مغر
مغرب
مفت
مفید
مق
مقاب
مقابلہ
مقابلے
مقام
مقر
مقرر
مقصد
مل
ملا
ملاح
ملاز
ملازم
ملازمت
ملاقات
ملتا
ملتی
ملتے
ملنا
ملنے
ملک
ملکہ
ملکی
ملی
ملیں
ملے
مم
مما
ممالک
ممانی
ممکن
ممی
من
منا
مناسب
منت
منتق
منتقل
مند
مندی
منزل
منصو
منصوبہ
منصور
منظ
منظر
منظور
منع
منوں
منٹ
منڈ
منڈی
منگ
منگوا
منھ
منہ
منی
منیر
منے
مو
موبا
موبائل
موت
موتی
موجود
موجودگی
مود
مور
موسم
موسی
موسیٰ
موضوع
موقع
مول
مولوی
مون
موٹا
موٹر
موٹی
موٹے
موچی
موڑ
مُ
مٹ
مٹھ
مٹھائی
مٹھو
مٹی
مچ
مچا
مچھ
مچھلی
مچھلیاں
مچھیرے
مڑ
مک
مکان
مکمل
مکھ
مکھی
مگر
مگرمچھ
مگن
مہ
مہر
مہربان
مہربانی
مہم
مہمان
مہمانوں
مہن
مہنگا
مہی
مہینہ
مہینے
می
میا
میان
میاں
میت
مید
میدان
میر
میرا
میری
میرے
میز
میل
میلہ
میلے
مین
مینڈ
مینڈک
میٰ
میٹر
میٹرک
میٹھی
میچ
میڈ
میڈم
میں
مے
ن
نئی
نئے
نا
نا،
نائی
نارا
ناراض
ناز
نازیہ
ناشتہ
ناشتے
ناصر
نال
نام
نامی
نان
نانا
نانی
ناک
ناکام
ناں
ناہ
نایاب
نبی
نت
نتی
نتیجہ
نتیجے
نج
نجات
نجو
ند
ندا
ندر
ندھ
ندہ
ندی
ندیم
ندے
نر
نرم
نرمی
نز
نزد
نزدیک
نس
نسل
نسپل
نش
نشان
نشانہ
نص
نصر
نصی
نصیب
نصیحت
نظ
نظام
نظر
نظروں
نظریں
نع
نعمان
نعمت
نف
نفرت
نق
نقص
نقصان
نقل
نل
نم
نما
نماز
نمایاں
نمبر
نمو
نمودار
نمک
نن
ننھ
ننھا
ننھی
ننھے
نو
نوا
نواب
نوازا
نوجوان
نوجوانوں
نور
نوری
نوٹ
نوکر
نوکری
نوں
نوی
نوید
نویں
نٹ
نٹوں
نچ
نڈ
نڈھ
نڈی
نک
نکا
نکال
نکالا
نکالنے
نکالی
نکالے
نکل
نکلا
نکلتا
نکلتے
نکلنے
نکلی
نکلے
نگ
نگا
نگاہ
نگاہوں
نگر
نگرانی
نگھ
نگی
نگے
نہ
نہا
نہال
نہایت
نہر
نہیں
نہیں،
نی
نیا
نیاز
نیت
نیلم
نیلے
نیم
نیند
نیو
نیٹ
نیچے
نیک
نیکی
نے
ه
و
و،
وا
واب
واجد
واحد
وادی
وار
واز
واضح
واق
واقع
واقعات
واقعہ
واقعی
واقعے
واقف
وال
والا
والد
والدہ
والدین
والوں
والی
والے
وان
واپ
واپس
واپسی
واں
واہ
وب
وت
وجود
وجہ
وح
ور
ورا
ورت
ورس
ورسٹی
ورنہ
ورک
وری
وز
وزن
وزیر
وزیہ
وس
وسلم
وسی
وص
وصول
وض
وط
وطن
وع
وعدہ
وغیر
وغیرہ
وف
وفا
وفات
وفادار
وق
وقار
وقت
وقو
وقوف
ول
ولی
ون
وٴ
وٴں
وٹ
وں
وہ
وہاں
وہر
وہی
وہیں
وی
ویسا
ویسے
ویل
ویلی
وے
ً
ٌ
ٍ
َ
َر
ََ
ُ
ُو
ِ
ِل
ّ
ّا
ّت
ّو
ّی
ّے
ْ
ٓ
ٔ
ٖ
٭
ٰ
ٴ
ٹ
ٹا
ٹائر
ٹائم
ٹانگ
ٹانگوں
ٹانگیں
ٹر
ٹری
ٹس
ٹل
ٹن
ٹنکو
ٹو
ٹون
ٹوٹ
ٹوٹی
ٹوپی
ٹوکری
ٹوں
ٹک
ٹکرا
ٹکٹ
ٹکڑا
ٹکڑے
ٹھ
ٹھا
ٹھنڈ
ٹھنڈا
ٹھنڈی
ٹھنڈے
ٹھہر
ٹھی
ٹھیک
ٹھے
ٹی
ٹیاں
ٹیبل
ٹیسٹ
ٹیلے
ٹیم
ٹین
ٹیو
ٹیچر
ٹیک
ٹیں
ٹے
پ
پا
پاؤں
پائی
پائے
پاب
پابندی
پاتے
پار
پارک
پاس
پال
پان
پانچ
پانچویں
پانی
پاپ
پاپا
پاک
پاکستان
پاکستانی
پاگل
پایا
پتا
پتال
پتوں
پتھر
پتہ
پتے
پر
پرانا
پرانی
پرانے
پرس
پرستان
پرند
پرندوں
پرندہ
پرندے
پرنسپل
پرو
پروا
پرواز
پرور
پروفیسر
پروگرام
پروں
پرچم
پری
پریاں
پریشان
پریشانی
پریوں
پس
پسن
پسند
پسندیدہ
پل
پلا
پلنگ
پلٹ
پلیز
پلیٹ
پن
پناہ
پنجرے
پنجوں
پندرہ
پنکی
پنگ
پو
پودوں
پودے
پور
پورا
پورٹ
پوری
پورے
پوزیشن
پولیس
پون
پوچھ
پوچھا
پوچھنے
پوچھی
پَر
پُ
پُر
پٹ
پٹا
پٹی
پچ
پچاس
پچھ
پچھتا
پچھلے
پڑ
پڑا
پڑتا
پڑتی
پڑتے
پڑوس
پڑوسی
پڑوں
پڑھ
پڑھا
پڑھائی
پڑھتا
پڑھتے
پڑھنا
پڑھنے
پڑھے
پڑی
پڑیں
پڑے
پک
پکا
پکار
پکڑ
پکڑا
پکڑنے
پکڑے
پکی
پکے
پھ
پھاڑ
پھر
پھرتی
پھرتے
پھرنے
پھل
پھلوں
پھن
پھنس
پھو
پھول
پھولوں
پھوٹ
پھٹ
پھٹی
پھی
پھیر
پھیل
پھیلا
پھینک
پہ
پہا
پہاڑ
پہاڑوں
پہاڑی
پہر
پہلا
پہلو
پہلی
پہلے
پہن
پہنا
پہنچ
پہنچا
پہنچتے
پہنچنے
پہنچی
پہنچے
پہنے
پہچان
پی
پیا
پیار
پیارا
پیاری
پیارے
پیاس
پیتے
پیدا
پیدل
پیر
پیروں
پیسوں
پیسہ
پیسے
پیش
پیغام
پین
پینے
پیو
پیوٹر
پیٹ
پیٹھ
پیپر
پیچھا
پیچھے
پیڑ
پیک
پے
چ
چا
چائی
چائے
چابی
چادر
چار
چاروں
چارپائی
چارہ
چاری
چارے
چال
چالاک
چان
چاند
چاندی
چانک
چاول
چاپ
چاچا
چاچو
چاک
چاکلیٹ
چاہ
چاہئے
چاہا
چاہتا
چاہتی
چاہتے
چاہی
چاہیے
چاہے
چر
چرا
چراغ
چس
چش
چل
چلا
چلانے
چلایا
چلتا
چلتی
چلتے
چلنا
چلنے
چلو
چلی
چلیں
چلے
چم
چمک
چن
چنانچہ
چند
چنے
چو
چودھری
چور
چوروں
چوری
چوزے
چول
چون
چونچ
چونک
چونکہ
چوٹ
چوکی
چوکیدار
چوں
چوہ
چوہا
چوہدری
چوہوں
چوہے
چُ
چٹ
چپ
چپکے
چچا
چڑ
چڑا
چڑھ
چڑھا
چڑی
چڑیا
چڑیاں
چڑیوں
چک
چکا
چکر
چکی
چکے
چھ
چھا
چھت
چھل
چھلانگ
چھو
چھوٹ
چھوٹا
چھوٹی
چھوٹے
چھوڑ
چھوڑا
چھٹی
چھٹیاں
چھٹیوں
چھپ
چھپا
چھڑ
چھڑا
چھڑی
چھی
چھین
چھے
چہ
چہر
چہرہ
چہرے
چہل
چی
چیت
چیتا
چیتے
چیخ
چیخنے
چیز
چیزوں
چیزیں
چیل
چین
چینی
چیون
چیونٹی
چیونٹیاں
چیونٹیوں
چیک
چے
ڈ
ڈا
ڈائ
ڈال
ڈالا
ڈالی
ڈالے
ڈانٹ
ڈاک
ڈاکو
ڈاکوؤں
ڈاکٹر
ڈب
ڈبے
ڈر
ڈرا
ڈرائ
ڈرائنگ
ڈرائی
ڈرائیور
ڈرتے
ڈری
ڈنڈ
ڈو
ڈوب
ڈور
ڈھ
ڈھول
ڈھون
ڈھونڈ
ڈھونڈنے
ڈھی
ڈھیر
ڈی
ڈیو
ڈیوٹی
ڈے
ڑ
ڑا
ڑائی
ڑوں
ڑپ
ڑک
ڑھ
ڑھی
ڑی
ڑیا
ڑیوں
ڑیے
ڑے
ژ
ژراف
ک
کئی
کئے
کا
کائیں
کار
کارنام
کارو
کاروبار
کارڈ
کاری
کاش
کاشف
کاغذ
کافی
کال
کالا
کالج
کالو
کالی
کالے
کام
کامران
کاموں
کامی
کامیاب
کامیابی
کان
کانوں
کانپ
کاٹ
کاٹنے
کاپ
کاپی
کب
کبو
کبوتر
کبھار
کبھی
کت
کتا
کتاب
کتابوں
کتابیں
کتنا
کتنی
کتنے
کتے
کر
کرا
کرائی
کرائے
کرام
کرانے
کراچی
کراہ
کرتا
کرتی
کرتیں
کرتے
کردار
کردو
کردی
کردیا
کردیں
کردے
کررہا
کررہی
کررہے
کرسی
کرلی
کرلیا
کرلیں
کرلے
کرم
کرن
کرنا
کرنی
کرنے
کرو
کرو،
کروا
کروانے
کروایا
کروں
کرکٹ
کرکے
کری
کریم
کریں
کرے
کز
کس
کسان
کسی
کش
کشتی
کل
کلاس
کلو
کلہا
کلی
کم
کما
کمائی
کمال
کمانے
کمر
کمرہ
کمرے
کمزور
کمپ
کمپنی
کمپیوٹر
کمہار
کمی
کن
کنارے
کنجوس
کندھ
کندھے
کنواں
کنویں
کنی
کنے
کو
کوئی
کوا
کوتو
کوتوال
کود
کور
کوشش
کول
کون
کونے
کوٹ
کوڑے
کوں
کوے
کُ
کٹ
کپڑا
کپڑوں
کپڑے
کچر
کچرا
کچرے
کچن
کچھ
کچھوے
کھ
کھا
کھائی
کھائیں
کھائے
کھاتا
کھاتے
کھال
کھانا
کھانے
کھایا
کھجور
کھل
کھلا
کھلاڑی
کھلو
کھلونوں
کھلونے
کھلی
کھلے
کھو
کھود
کھول
کھولا
کھولنے
کھولی
کھٹ
کھڑ
کھڑا
کھڑکی
کھڑی
کھڑے
کھی
کھیت
کھیتوں
کھیر
کھیل
کھیلتے
کھیلنے
کھینچ
کھے
کہ
کہا
کہا،
کہانی
کہانیاں
کہانیوں
کہاں
کہتا
کہتی
کہتے
کہنا
کہنے
کہو
کہوں
کہہ
کہی
کہیں
کہے
کی
کی،
کیا
کیا،
کیاں
کیجیے
کیس
کیسا
کیسی
کیسے
کیل
کیلئے
کیلے
کیم
کین
کیونکہ
کیوں
کیک
کیں
کیے
کے
گ
گئی
گئی،
گئیں
گئے
گئے،
گا
گا،
گاؤں
گائے
گار
گارڈ
گال
گامو
گانے
گاوٴں
گاڑ
گاڑی
گاہ
گاہک
گد
گدھا
گدھے
گر
گرا
گرام
گرتے
گرج
گرد
گردن
گرفت
گرفتار
گرم
گرمی
گرمیوں
گرنے
گروہ
گرہ
گری
گرے
گز
گزار
گزارنے
گزر
گزرا
گزرتا
گزرتے
گزرنے
گزری
گزرے
گزشتہ
گفت
گفتگو
گل
گلا
گلاب
گلاس
گلشن
گلفام
گلہ
گلہری
گلی
گلے
گم
گن
گنا
گناہ
گند
گندم
گو
گوار
گود
گور
گوش
گوشت
گوشی
گول
گولی
گون
گونج
گویا
گڑ
گڑا
گڑھ
گڑھے
گڑیا
گھ
گھاس
گھبرا
گھر
گھروں
گھس
گھما
گھن
گھنٹی
گھنٹے
گھنے
گھو
گھور
گھوم
گھومتے
گھومنے
گھون
گھونسلا
گھونسلے
گھوڑا
گھوڑوں
گھوڑے
گھٹ
گھڑ
گھڑی
گھی
گہ
گہرا
گہری
گہرے
گی
گی،
گیا
گیا،
گیدڑ
گیر
گیم
گیند
گیٹ
گے
گے،
ں
ھ
ھر
ہ
ہا
ہائی
ہائے
ہاتھ
ہاتھوں
ہاتھی
ہاتھیوں
ہار
ہارے
ہاشم
ہال
ہان
ہانیہ
ہاں
ہاں،
ہتھ
ہجو
ہجوم
ہدا
ہدایت
ہر
ہرا
ہرن
ہری
ہرے
ہزار
ہزاروں
ہس
ہسپتال
ہف
ہفتہ
ہفتے
ہل
ہلا
ہلاک
ہلایا
ہلکی
ہلکے
ہم
ہمارا
ہماری
ہمارے
ہمت
ہمدردی
ہمی
ہمیشہ
ہمیں
ہن
ہندو
ہنر
ہنس
ہنستے
ہنسنے
ہنسی
ہو
ہو،
ہوئی
ہوئی،
ہوئیں
ہوئے
ہوا
ہوا،
ہوتا
ہوتاہے
ہوتو
ہوتی
ہوتے
ہوجائیں
ہوجائے
ہوجاتا
ہوجاتی
ہور
ہورہا
ہورہی
ہوسکتا
ہوش
ہوشیار
ہوم
ہونا
ہونے
ہوٹل
ہوکر
ہوگئی
ہوگئیں
ہوگئے
ہوگا
ہوگی
ہوگیا
ہوں
ہوں،
ہوۓ
ہٹ
ہٹا
ہڈ
ہی
ہید
ہیرے
ہیم
ہین
ہیڈ
ہیں
ہیں،
ہے
ہے،
ہے،اس
ہے،لیکن
ہے،مگر
ۃ
ی
یا
یاب
یابی
یات
یاد
یار
یاری
یاسر
یاط
یافتہ
یال
یاں
یبت
یت
یر
یرا
یران
یروں
یری
یرے
یز
یش
یعنی
یقی
یقین
یقینا
یم
ین
یو
یوس
یوسف
یون
یونہی
یونی
یوں
یک
یکا
یکل
یکھ
یں
یں،
یہ
یہاں
یہی
یہیں
یے
ے
ۓ
۰
۱
۲
۳
۴
۵
۶
۷
۹



